def area(a, b):
    '''
    Возвращает площадь прямоугольника

        Параметры:
            a(int): ширина прямоугольника (1 сторона)
            b(int): длина прямоугольника (2 сторона)

        Возвращаемое значение:
            a * b: площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника

        Параметры:
            a(int): ширина прямоугольника (1 сторона)
            b(int): длина прямоугольника (2 сторона)

        Возвращаемое значение:
            2*(a + b): периметр прямоугольника
    '''
    return 2*(a + b)
