def area(a, h):
    '''
    Возвращает площадь треугольника

        Параметры:
            a(int): основание треугольника
            h(int): высота треугольника

        Возвращаемое значение:
            a * h / 2: площадь треугольника
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника

        Параметры:
            a(int): 1 сторона треугольника
            b(int): 2 сторона треугольника
            c(int): 3 сторона треугольника

        Возвращаемое значение:
            a + b + c: периметр треугольника
    '''
    return a + b + c
